name: "perception_ensembled"
platform: "ensemble"
max_batch_size: 0

input [
  {
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]  # Dynamic height and width, 3 channels (BGR image)
  }
]

output [
  {
    name: "boxes"
    data_type: TYPE_INT32
    dims: [-1, 4]  # N detections, 4 coordinates (x1, y1, x2, y2)
  },
  {
    name: "scores"
    data_type: TYPE_FP16
    dims: [-1]  # N detections, confidence scores
  },
  {
    name: "class_ids"
    data_type: TYPE_INT32
    dims: [-1]  # N detections, class IDs
  }
]

ensemble_scheduling {
  step [
    {
      model_name: "perception_preprocessing"
      model_version: -1
      input_map {
        key: "input_image"
        value: "input_image"
      }
      output_map {
        key: "preprocessed_blob"
        value: "preprocessed_blob"
      }
      output_map {
        key: "original_height"
        value: "original_height"
      }
      output_map {
        key: "original_width"
        value: "original_width"
      }
    },
    {
      model_name: "perception"
      model_version: -1
      input_map {
        key: "images"
        value: "preprocessed_blob"
      }
      output_map {
        key: "output0"
        value: "output0"
      }
    },
    {
      model_name: "perception_postprocessing"
      model_version: -1
      input_map {
        key: "output0"
        value: "output0"
      }
      input_map {
        key: "original_height"
        value: "original_height"
      }
      input_map {
        key: "original_width"
        value: "original_width"
      }
      output_map {
        key: "boxes"
        value: "boxes"
      }
      output_map {
        key: "scores"
        value: "scores"
      }
      output_map {
        key: "class_ids"
        value: "class_ids"
      }
    }
  ]
}
